; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image4 - mode
	thermograph3 - mode
	image1 - mode
	Star8 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation13 - direction
	Star10 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Star0 - direction
	Star7 - direction
	GroundStation9 - direction
	Star14 - direction
	Star12 - direction
	Star4 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation13)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star6)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph3)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet18)
	(supports instrument3 image4)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star10)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation9)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument5 thermograph2)
	(supports instrument5 image4)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph3)
	(supports instrument6 thermograph2)
	(supports instrument6 image4)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet18)
	(supports instrument7 image4)
	(supports instrument7 image1)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star12)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 Star7)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet18)
)
(:goal (and
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph3)
	(have_image Star17 thermograph0)
	(have_image Planet18 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation9)
   goals met: 0 of 4
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 4
3. (calibrate satellite1 instrument4 groundstation9)
   added: (calibrated instrument4)
   goals met: 0 of 4
4. (turn_to satellite1 planet15 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 planet15)
   goals met: 0 of 4
5. (take_image satellite1 planet15 instrument4 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 4
6. (turn_to satellite1 phenomenon16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 4
7. (take_image satellite1 phenomenon16 instrument4 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 2 of 4
8. (turn_to satellite1 planet18 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet18)
   goals met: 2 of 4
9. (take_image satellite1 planet18 instrument4 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 3 of 4
10. (turn_to satellite1 star17 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star17)
   goals met: 3 of 4
11. (take_image satellite1 star17 instrument4 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 4 of 4
